In [1]:
print('hello world')

hello world

Pandas:
- Series
- Dataframe

In [2]:
X = [2,4,6,8,0]

In [3]:
import pandas as pd

In [5]:
thing = pd.Series(X)
thing

0    2
1    4
2    6
3    8
4    0
dtype: int64

In [11]:
data = {
    'name': ['Rob', 'Nirosh', 'Jeni'],
    'age' : [30,31,29]    
}

In [12]:
df = pd.DataFrame(data)
df

     name  age
0     Rob   30
1  Nirosh   31
2    Jeni   29

In [22]:
df['newcolname'] = 2
df

     name  age  newcolname
0     Rob   30           2
1  Nirosh   31           2
2    Jeni   29           2

In [19]:
df.loc[(df['name']=='Rob') & (df['age']>20), :]

  name  age
0  Rob   30

In [ ]:
# REMEMBER:
#df.loc[ROWS,COLS]

# : means everything

In [21]:
df.loc[:,'age']

0    30
1    31
2    29
Name: age, dtype: int64

# Functions

In [23]:
def sayHello():
    print('My Name is Nirosh!')

In [24]:
sayHello()

My Name is Nirosh!

In [25]:
def sayHello_v2(name):
    print(f"Hi my name is {name}")

In [27]:
sayHello_v2(name='Jaz')

Hi my name is Jaz

In [29]:
def addition(num1, num2):
    return num1 + num2

In [31]:
answer = addition(1,4)
print(answer)

5

In [33]:
sayHello()

Hello World

In [9]:
from archive.myFirstScript import *

In [10]:
sayHelloWorld()

Hello World